app/controllers/players_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 190], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "lifetime_dna" = $2, "updated_at" = $3 WHERE "players"."id" = $4  [["dna", 201.0], ["lifetime_dna", 1.0], ["updated_at", "2019-01-11 17:50:32.979351"], ["id", 190]]
---
	def click
		@player = Player.find(params[:player_id])
		click_get_dna = 1 + @player.level + @player.level2 * 5 + @player.level3 * 50 + @player.level4 * 90 + @player.level5 * 300 + @player.level6 * 500 + @player.level7 * 850 + @player.level8 * 1200 + @player.level9 * 30000 + @player.level10 * 999999
		@player.update_attributes(dna: @player.dna + click_get_dna, lifetime_dna: @player.lifetime_dna + click_get_dna)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 126], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level_cost" = $2, "level" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level_cost", 120.0], ["level", 1], ["updated_at", "2019-01-11 17:44:42.795100"], ["id", 134]]
---
	def buy_1
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level_cost
			@player.update_attributes(level: @player.level + 1, dna: @player.dna - @player.level_cost, level_cost: @player.level_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 425], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level2_cost" = $2, "level2" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level2_cost", 2200.0], ["level2", 1], ["updated_at", "2019-01-11 18:47:51.686973"], ["id", 426]]
---
	def buy_2
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level2_cost
			@player.update_attributes(level2: @player.level2 + 1, dna: @player.dna - @player.level2_cost, level2_cost: @player.level2_cost * 1.1)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 437], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level3_cost" = $2, "level3" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level3_cost", 5500.0], ["level3", 1], ["updated_at", "2019-01-11 18:48:28.052090"], ["id", 438]]
---
	def buy_3
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level3_cost
			@player.update_attributes(level3: @player.level3 + 1, dna: @player.dna - @player.level3_cost, level3_cost: @player.level3_cost * 1.1)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 463], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level4_cost" = $2, "level4" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level4_cost", 14400.0], ["level4", 1], ["updated_at", "2019-01-11 18:50:21.564099"], ["id", 464]]
---
	def buy_4
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level4_cost
			@player.update_attributes(level4: @player.level4 + 1, dna: @player.dna - @player.level4_cost, level4_cost: @player.level4_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 479], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level5_cost" = $2, "level5" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level5_cost", 55000.00000000001], ["level5", 1], ["updated_at", "2019-01-11 18:55:19.564836"], ["id", 480]]
---
	def buy_5
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level5_cost
			@player.update_attributes(level5: @player.level5 + 1, dna: @player.dna - @player.level5_cost, level5_cost: @player.level5_cost * 1.1)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 481], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level6_cost" = $2, "level6" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level6_cost", 84000.0], ["level6", 1], ["updated_at", "2019-01-11 18:55:19.594290"], ["id", 482]]
---
	def buy_6
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level6_cost
			@player.update_attributes(level6: @player.level6 + 1, dna: @player.dna - @player.level6_cost, level6_cost: @player.level6_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 483], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level7_cost" = $2, "level7" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level7_cost", 120000.0], ["level7", 1], ["updated_at", "2019-01-11 18:55:19.618970"], ["id", 484]]
---
		def buy_7
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level7_cost
			@player.update_attributes(level7: @player.level7 + 1, dna: @player.dna - @player.level7_cost, level7_cost: @player.level7_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 485], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level8_cost" = $2, "level8" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level8_cost", 180000.0], ["level8", 1], ["updated_at", "2019-01-11 18:55:19.641366"], ["id", 486]]
---
	def buy_8
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level8_cost
			@player.update_attributes(level8: @player.level8 + 1, dna: @player.dna - @player.level8_cost, level8_cost: @player.level8_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 487], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level9_cost" = $2, "level9" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level9_cost", 1200000.0], ["level9", 1], ["updated_at", "2019-01-11 18:55:19.662868"], ["id", 488]]
---
	def buy_9
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level9_cost
			@player.update_attributes(level9: @player.level9 + 1, dna: @player.dna - @player.level9_cost, level9_cost: @player.level9_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 489], ["LIMIT", 1]]
UPDATE "players" SET "dna" = $1, "level10_cost" = $2, "level10" = $3, "updated_at" = $4 WHERE "players"."id" = $5  [["dna", 0.0], ["level10_cost", 12000000.0], ["level10", 1], ["updated_at", "2019-01-11 18:55:19.683311"], ["id", 490]]
---
	def buy_10
		@player = Player.find(params[:player_id])
		if @player.dna >= @player.level10_cost
			@player.update_attributes(level10: @player.level10 + 1, dna: @player.dna - @player.level10_cost, level10_cost: @player.level10_cost * 1.2)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
---
	def find_player
		@player = Player.find(params[:id])